In [40]:
import pandas as pd

In [41]:
from sklearn.preprocessing import LabelEncoder

In [42]:
df=pd.read_csv('Agora.csv')
df

   Marketing Speed   Administration  Transport     Area    Profit
0       464565456.0      56465465.0  1354564.0    Dhaka   45445.0
1       546544455.0     545456456.0     5454.0      Ctg  564654.0
2        41564545.0          4545.0  4242524.0  Rangpur   56456.0
3        54146565.0           545.0    45245.0    Dhaka    5646.0
4       656465546.0           445.0        NaN  Rangpur   56465.0

In [43]:
mean=df.Transport.mean()

In [44]:
df.Transport=df.Transport.fillna(mean)

In [45]:
df

   Marketing Speed   Administration   Transport     Area    Profit
0       464565456.0      56465465.0  1354564.00    Dhaka   45445.0
1       546544455.0     545456456.0     5454.00      Ctg  564654.0
2        41564545.0          4545.0  4242524.00  Rangpur   56456.0
3        54146565.0           545.0    45245.00    Dhaka    5646.0
4       656465546.0           445.0  1411946.75  Rangpur   56465.0

In [46]:
dm=pd.get_dummies(df['Area'])
dm

   Ctg  Dhaka  Rangpur
0    0      1        0
1    1      0        0
2    0      0        1
3    0      1        0
4    0      0        1

In [47]:
 label=LabelEncoder()

In [48]:
df.Area =label.fit_transform(df['Area'])

In [49]:
df

   Marketing Speed   Administration   Transport  Area    Profit
0       464565456.0      56465465.0  1354564.00     1   45445.0
1       546544455.0     545456456.0     5454.00     0  564654.0
2        41564545.0          4545.0  4242524.00     2   56456.0
3        54146565.0           545.0    45245.00     1    5646.0
4       656465546.0           445.0  1411946.75     2   56465.0

In [50]:
pd.get_dummies(df['Area'])

   0  1  2
0  0  1  0
1  1  0  0
2  0  0  1
3  0  1  0
4  0  0  1

In [51]:
merge=pd.concat([df,dm],axis='columns')

In [52]:
merge

,Marketing Speed,Administration,Transport,Area,Profit,Ctg,Dhaka,Rangpur
0,464565456.0,56465465.0,1354564.00,1,45445.0,0,1,0
1,546544455.0,545456456.0,5454.00,0,564654.0,1,0,0
2,41564545.0,4545.0,4242524.00,2,56456.0,0,0,1
3,54146565.0,545.0,45245.00,1,5646.0,0,1,0
4,656465546.0,445.0,1411946.75,2,56465.0,0,0,1

In [53]:
final=merge.drop(['Area'],axis='columns')

In [54]:
final

   Marketing Speed   Administration   Transport    Profit  Ctg  Dhaka  Rangpur
0       464565456.0      56465465.0  1354564.00   45445.0    0      1        0
1       546544455.0     545456456.0     5454.00  564654.0    1      0        0
2        41564545.0          4545.0  4242524.00   56456.0    0      0        1
3        54146565.0           545.0    45245.00    5646.0    0      1        0
4       656465546.0           445.0  1411946.75   56465.0    0      0        1

# dependant and independant value separate

In [55]:
y=df['Administration']
y

0     56465465.0
1    545456456.0
2         4545.0
3          545.0
4          445.0
Name: Administration, dtype: float64

In [56]:
x=final.drop(['Administration'],axis=1)
x

   Marketing Speed    Transport    Profit  Ctg  Dhaka  Rangpur
0       464565456.0  1354564.00   45445.0    0      1        0
1       546544455.0     5454.00  564654.0    1      0        0
2        41564545.0  4242524.00   56456.0    0      0        1
3        54146565.0    45245.00    5646.0    0      1        0
4       656465546.0  1411946.75   56465.0    0      0        1

In [57]:
from sklearn.linear_model import LinearRegression

In [58]:
model=LinearRegression()

In [59]:
model.fit(x,y)

LinearRegression()

In [61]:
model.score(x,y)

1.0

In [63]:
model.predict([[464565456.0,1354564.00,45445.0,1,0,0]])

array([20209946.45227318])